<!DOCTYPE html><html lang="en"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1"><meta name="author" content="Zhihua Deng"><meta name="description" content="JavaGC&amp;#x8C03;&amp;#x4F18;&amp;#x7ECF;&amp;#x5386;&amp;#x57FA;&amp;#x672C;&amp;#x6982;&amp;#x5FF5;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x770B;&amp;#x8FC7;&amp;#x5F88;&amp;#x591A;&amp;#x5173;&amp;#"><meta name="keywords" content="JAVA,GC,HBase"><title>Java GC · null</title><link rel="icon" href="../favicon.ico"><link rel="canonical" href="https://dengzhhu653.github.io/GC/"><link rel="alternate" href="../atom.xml" title="null"><link rel="stylesheet" href="../fonts/iconfont/iconfont.css"><link rel="stylesheet" href="../css/style.css"><script type="text/javascript">var _hmt = _hmt || [];
(function() {
  var hm = document.createElement("script");
  hm.src = "//hm.baidu.com/hm.js?Your baidu Analytics ID";
  var s = document.getElementsByTagName("script")[0]; 
  s.parentNode.insertBefore(hm, s);
})();
</script><script type="text/javascript">(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
})(window,document,'script','//www.google-analytics.com/analytics.js','ga');

ga('create', 'Your Google Analytics ID', 'auto');
ga('send', 'pageview');</script></head><body><div id="main"><header><a href="../." class="logo"></a><ul class="nav"><li class="nav-link"><a href="/archives/" target="_self">归档</a></li><li class="nav-link"><a href="/about/" target="_self">关于</a></li></ul></header><section id="container"><article class="post"><h1 class="post-title">Java GC</h1><span class="post-time">Nov 11, 2017</span><div id="sidebar" class="post-sidebar"><h3 class="heading">目录</h3><ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#undefined"><span class="toc-text">Java GC 调优经历</span></a><ol class="toc-child"><li class="toc-item toc-level-2"><a class="toc-link" href="#undefined"><span class="toc-text">基本概念</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#undefined"><span class="toc-text">调优目标</span></a></li></ol></li></ol></div><div class="post-content"><h1><center>Java GC &#x8C03;&#x4F18;&#x7ECF;&#x5386;</center></h1>

<p></p><h2>&#x57FA;&#x672C;&#x6982;&#x5FF5;</h2><br>&#x4E4B;&#x524D;&#xFF0C;&#x770B;&#x8FC7;&#x5F88;&#x591A;&#x5173;&#x4E8E;GC&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5374;&#x4E00;&#x76F4;&#x6CA1;&#x6709;&#x5B9E;&#x8DF5;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7B97;&#x662F;&#x4E00;&#x7247;&#x6765;&#x7684;&#x6BD4;&#x8F83;&#x8FDF;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E00;&#x6B21;&#x96BE;&#x5F97;GC&#x8C03;&#x4F18;&#x7ECF;&#x5386;&#x7684;&#x603B;&#x7ED3;&#x3002;<p></p>
<p>&#x5173;&#x4E8E;Java GC&#x7684;&#x539F;&#x7406;&#xFF0C;oracle&#x5B98;&#x7F51;&#x548C;&#x4E00;&#x4E9B;&#x7F51;&#x7AD9;&#x4E0A;&#x6709;&#x4E86;&#x6BD4;&#x8F83;&#x8BE6;&#x5C3D;&#x7684;&#x5206;&#x6790;&#x548C;&#x63CF;&#x8FF0;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x8C08;&#x8C08;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x548C;&#x603B;&#x7ED3;:</p>
<p>&#x6839;&#x636E;&#x4E00;&#x4E9B;&#x7EDF;&#x8BA1;&#x7ECF;&#x9A8C;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x751F;&#x5B58;&#x671F;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x6BD4;&#x5982;&#x5728;java&#x65B9;&#x6CD5;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x968F;&#x7740;&#x65B9;&#x6CD5;&#x6808;&#x7684;&#x9000;&#x51FA;&#x800C;&#x53D8;&#x6210;&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E0E;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x957F;&#x77ED;&#x76F8;&#x5173;&#x3002;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x7684;&#x5BF9;&#x8C61;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5E38;&#x9A7B;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x52A0;&#x5FEB;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;<br><br><img src="/GC/demography.png" alt="demography.png" title=""></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4EBA;&#x4E3A;&#x5730;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5206;&#x6210;&#x5E74;&#x8F7B;&#x4EE3;&#x548C;&#x5E74;&#x8001;&#x4EE3;&#xFF0C;&#x7531;&#x4E8E;JVM&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x662F;&#x5E0C;&#x671B;&#x6C38;&#x9A7B;&#x5E94;&#x7528;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x89C4;&#x5219;&#xFF1A;&#x5F53;&#x5904;&#x4E8E;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x6BCF;&#x7ECF;&#x5386;&#x4E00;&#x6B21;GC&#x65F6;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;age&#x5C31;&#x589E;&#x52A0;1&#xFF0C;&#x5F53;&#x8FBE;&#x5230;&#x9884;&#x5148;&#x8BBE;&#x7F6E;&#x7684;&#x9608;&#x503C;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4FBF;&#x5347;&#x7EA7;&#x4E3A;&#x4E00;&#x4E2A;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x521A;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5176;age&#x4E3A;0&#x3002;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x90FD;&#x5B58;&#x50A8;&#x5728;JVM&#x5B9A;&#x4E49;&#x7684;&#x5806;&#x4E2D;&#xFF0C;&#x5806;&#x4E5F;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x5206;&#x4E3A;&#x5E74;&#x8F7B;&#x4EE3;&#x548C;&#x5E74;&#x8001;&#x4EE3;&#x3002;</p>
<p>&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x6D3B;&#x8DC3;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x521B;&#x5EFA;&#x7684;&#x5FEB;&#xFF0C;&#x53D8;&#x6210;&#x5783;&#x573E;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x5FEB;&#xFF1B;&#x800C;&#x5E74;&#x8001;&#x4EE3;&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x5219;&#x5386;&#x7ECF;&#x78E8;&#x7EC3;&#xFF0C;&#x76F8;&#x5BF9;&#x5E74;&#x8F7B;&#x4EE3;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x4EC5;&#x4EC5;&#x4F5C;&#x7528;&#x4E0E;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x8F83;&#x800C;&#x8A00;&#xFF0C;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E24;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x7684;GC&#xFF0C;&#x53EF;&#x4EE5;&#x533A;&#x522B;&#x5BF9;&#x5F85;&#x3002;&#x5E38;&#x89C1;&#x7684;GC&#x7B97;&#x6CD5;&#x6709;copy(&#x590D;&#x5236;)&#x7B97;&#x6CD5;&#x548C;&#x6807;&#x8BB0;&#xFF0D;&#x6574;&#x7406;&#x6CD5;&#x3002;</p>
<p>&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#xFF0C;&#x4F9D;&#x636E;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF0C;age&#x8D85;&#x8FC7;&#x67D0;&#x4E00;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x663E;&#x8457;&#x7684;&#x51CF;&#x5C11;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#xFF0C;&#x5185;&#x5B58;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2D;GC&#x7684;&#x56DE;&#x6536;&#x9002;&#x7528;copy&#x7B97;&#x6CD5;&#xFF0C;&#x5C06;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x62F7;&#x8D1D;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7A7A;&#x7F6E;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x5185;&#xFF0C;&#x539F;&#x6765;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x7684;&#x533A;&#x57DF;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x788E;&#x7247;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x7B80;&#x5355;&#x6709;&#x6548;&#xFF0C;&#x517C;&#x987E;&#x6548;&#x7387;&#x4EE5;&#x53CA;GC&#x540E;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#xFF0C;&#x9700;&#x8981;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#x7684;&#x73B0;&#x5B9E;&#x9700;&#x6C42;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x597D;&#x6BD4;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x8981;&#x597D;&#x8FC7;&#x5FEB;&#x6392;(&#x8FD9;&#x4E5F;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;survivor&#x7684;&#x539F;&#x56E0;)&#x3002;</p>
<p>&#x5E74;&#x8001;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x53EF;&#x80FD;&#x8D85;&#x8FC7;50%&#x7684;&#x5BF9;&#x8C61;&#x5728;GC&#x5230;&#x6765;&#x65F6;&#xFF0C;&#x662F;&#x53EF;&#x8FBE;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x867D;&#x7136;&#x6709;&#x5229;&#x4E8E;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x6574;&#x7406;&#x3002;&#x4F46;&#x662F;&#x8981;&#x6C42;&#x5728;GC&#x671F;&#x95F4;&#xFF0C;&#x8981;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x62F7;&#x8D1D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#xFF0C;&#x4E3A;&#x5BF9;&#x8C61;&#x627E;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x6697;&#x793A;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x95F4;&#x53D8;&#x957F;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x8981;&#x6C42;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x4E0D;&#x5E0C;&#x671B;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5F88;&#x5927;&#x7684;&#x5E74;&#x8001;&#x4EE3;&#x6765;&#x7F13;&#x5B58;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x65F6;&#x3002;&#x8FD9;&#x6837;&#x590D;&#x5236;&#x7684;&#x7B97;&#x6CD5;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x5E74;&#x8001;&#x4EE3;&#xFF0C;&#x800C;&#x6807;&#x8BB0;&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x5374;&#x53EF;&#x80DC;&#x4EFB;&#x8FD9;&#x6837;&#x7684;&#x573A;&#x666F;&#x3002;</p>
<p>Java&#x7684;CMS&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x4ECE;&#x601D;&#x60F3;&#x4E0A;&#x770B;&#xFF0C;&#x662F;&#x6807;&#x8BB0;&#x6574;&#x7406;&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x79CD;&#x5347;&#x7EA7;&#xFF0C;&#x4E3A;&#x4E86;&#x9002;&#x5E94;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x9700;&#x6C42;&#xFF0C;CMS&#x5C06;&#x56DE;&#x6536;&#x673A;&#x5236;&#x5206;&#x6210;7&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E9B;&#x9636;&#x6BB5;&#x53EF;&#x4EE5;&#x5728;&#x65E5;&#x5FD7;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1A;</p>
<pre>
2016-08-25T19:46:17.113+0800: 3.424: [GC (CMS Initial Mark) [1 CMS-initial-mark: 0K(11354112K)] 52106K(12460032K), 0.0032642 secs] [Times: user=0.01 sys=0.00, real=0.01 secs]
2016-08-25T19:46:17.116+0800: 3.427: [CMS-concurrent-mark-start]
2016-08-25T19:46:17.119+0800: 3.430: [CMS-concurrent-mark: 0.002/0.002 secs] [Times: user=0.03 sys=0.01, real=0.00 secs]
2016-08-25T19:46:17.119+0800: 3.430: [CMS-concurrent-preclean-start]
2016-08-25T19:46:17.150+0800: 3.461: [CMS-concurrent-preclean: 0.031/0.031 secs] [Times: user=0.10 sys=0.00, real=0.03 secs]
2016-08-25T19:46:17.150+0800: 3.461: [CMS-concurrent-abortable-preclean-start]
 CMS: abort preclean due to time 2016-08-25T19:46:18.169+0800: 4.480: [CMS-concurrent-abortable-preclean: 0.832/1.018 secs] [Times: user=3.47 sys=0.12, real=1.02 secs]
2016-08-25T19:46:18.169+0800: 4.480: [GC (CMS Final Remark) [YG occupancy: 248283 K (1105920 K)]2016-08-25T19:46:18.169+0800: 4.480: [GC (CMS Final Remark) 2016-08-25T19:46:18.169+0800: 4.480: [ParNew
Desired survivor size 106954752 bytes, new threshold 6 (max 6)
- age   1:    6159048 bytes,    6159048 total
- age   2:    6537288 bytes,   12696336 total
  : 248283K-&gt;15319K(1105920K), 0.0257818 secs] 248283K-&gt;15319K(12460032K), 0.0259120 secs] [Times: user=0.37 sys=0.02, real=0.02 secs]
  2016-08-25T19:46:18.195+0800: 4.506: [Rescan (parallel) , 0.0044843 secs]2016-08-25T19:46:18.200+0800: 4.511: [weak refs processing, 0.0000427 secs]2016-08-25T19:46:18.200+0800: 4.511: [class unloading, 0.0050959 secs]2016-08-25T19:46:18.205+0800: 4.516: [scrub symbol table, 0.0043472 secs]2016-08-25T19:46:18.209+0800: 4.520: [scrub string table, 0.0006284 secs][1 CMS-remark: 0K(11354112K)] 15319K(12460032K), 0.0418459 secs] [Times: user=0.46 sys=0.02, real=0.04 secs]
  2016-08-25T19:46:18.211+0800: 4.522: [CMS-concurrent-sweep-start]
  2016-08-25T19:46:18.211+0800: 4.522: [CMS-concurrent-sweep: 0.000/0.000 secs] [Times: user=0.00 sys=0.00, real=0.00 secs]
  2016-08-25T19:46:18.211+0800: 4.522: [CMS-concurrent-reset-start]
  2016-08-25T19:46:18.271+0800: 4.582: [CMS-concurrent-reset: 0.057/0.060 secs] [Times: user=0.15 sys=0.05, real=0.06 secs]
  </pre>

<p>&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x4E00;&#x4E0B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x8FD9;&#x4E9B;&#x9636;&#x6BB5;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#xFF0C;&#x4FBF;&#x4F1A;&#x660E;&#x767D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;CMS&#x79F0;&#x5F97;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x4F4E;&#x5EF6;&#x65F6;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x3002;<br></p>
<p>&#x6309;&#x7167;&#x7B97;&#x6CD5;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6807;&#x8BB0;&#x662F;&#x6574;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x6574;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5C06;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x5148;&#x6807;&#x8BB0;&#x51FA;&#x6765;&#x3002;&#x5BF9;&#x8C61;&#x4E0E;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5F15;&#x7528;&#x4EE5;&#x53CA;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x5173;&#x7CFB;&#xFF1A;</p>
<pre>
  A-&gt;B, A&#x5BF9;&#x8C61;&#x6709;&#x4E2A;&#x5F15;&#x7528;&#x6307;&#x5411;B&#x5BF9;&#x8C61;&#xFF0C;&#x79F0;A&#x5BF9;&#x8C61;&#x4E0E;B&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;1.
  A B, A&#x4E0E;B&#x5BF9;&#x8C61;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x5219;A&#x5BF9;&#x8C61;&#x4E0E;B&#x5BF9;&#x8C61;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;0.
  A -&gt; B -&gt;C, &#x4F20;&#x9012;&#x4F9D;&#x8D56;&#xFF0C;A&#x5BF9;&#x8C61;&#x4E0E;C&#x5BF9;&#x8C61;&#x7684;&#x8DDD;&#x79BB;&#x4E3A;2.
</pre>
CMS&#x4E2D;&#x7684;```initial mark```&#x9636;&#x6BB5;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x662F;&#x4ECE;&#x7EBF;&#x7A0B;&#x6808;&#x96C6;&#x4E2D;&#x6216;&#x8005;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x6839;&#x96C6;&#xFF0C;&#x987A;&#x85E4;&#x6478;&#x74DC;&#x5F0F;&#x7684;&#x627E;&#x51FA;&#x5728;old&#x533A;&#x57DF;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#xFF0C;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x8001;&#x5E74;&#x533A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x5FEB;&#x7167;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x6682;&#x505C;&#x5E94;&#x7528;&#x65F6;&#x95F4;&#xFF0C;&#x53EA;&#x6807;&#x8BB0;old&#x533A;&#x57DF;&#x5185;&#x90A3;&#x4E9B;&#x4E0E;&#x6839;&#x96C6;&#x5BF9;&#x8C61;&#x4E2D;&#x8DDD;&#x79BB;&#x4E3A;1&#x7684;&#x5BF9;&#x8C61;&#x96C6;S. &#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x4E00;&#x822C;&#x8BF4;&#x6765;&#xFF0C;&#x662F;&#x6BD4;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x95F4;&#x8981;&#x77ED;&#x3002;

&#x4E0B;&#x4E00;&#x6B65;&#xFF0C;&#x8FDB;&#x884C;&#x7684;&#x5219;&#x662F;```CMS-concurrent-mark```&#x3002;&#x5728;&#x524D;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x5B8C;&#x6210;mark&#x5E94;&#x8BE5;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x4E1A;&#xFF0C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x6807;&#x8BB0;&#x8001;&#x5E74;&#x4EE3;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4ECE;&#x4E0A;&#x4E00;&#x6B65;&#x627E;&#x5230;&#x7684;&#x96C6;&#x5408;S&#x51FA;&#x53D1;&#xFF0C;&#x627E;&#x51FA;&#x4E0E;&#x96C6;&#x5408;S&#x5BF9;&#x8C61;&#x8DDD;&#x79BB;&gt;0&#x7684;&#x6240;&#x6709;&#x8001;&#x5E74;&#x4EE3;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x6807;&#x8BB0;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x4EA7;&#x751F;&#x7684;&#x96C6;&#x5408;&#x6807;&#x8BB0;&#x4E3A;T&#x3002; &#x8FD9;&#x4E00;&#x9636;&#x6BB5;&#x662F;&#x4E2A;&#x5E94;&#x7528;&#x4E00;&#x8D77;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#x3002;
&#x5728;mark&#x9636;&#x6BB5;&#xFF0C;&#x5E94;&#x7528;&#x662F;&#x548C;GC&#x7EBF;&#x7A0B;&#x4E00;&#x8D77;&#x5E76;&#x53D1;&#x53BB;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x671F;&#x95F4;&#xFF0C;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x539F;&#x6765;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;_alive_&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x53D1;&#x751F;&#x66F4;&#x6539;&#xFF0C;&#x6307;&#x5411;mark&#x9636;&#x6BB5;&#x672A;&#x88AB;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;;&#x6216;&#x8005;&#xFF0C;&#x5728;&#x8FD9;&#x671F;&#x95F4;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;promote&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x3002;&#x56E0;&#x6B64;mark&#x9636;&#x6BB5;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x8001;&#x5E74;&#x4EE3;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x7136;&#x800C;&#x5374;&#x4FDD;&#x5B58;&#x5728;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x8BB0;&#x5F55;&#x3002;Remark&#x9636;&#x6BB5;&#x7684;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x626B;&#x63CF;&#x88AB;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x66F4;&#x6539;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x62EC;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x96C6;.&#x4E3A;&#x4E86;&#x51CF;&#x5C11;Remark&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x4E8E;&#x662F;&#x4E00;&#x4E2A;concurrent preclean&#x7684;&#x9636;&#x6BB5;&#x5E2E;&#x52A9;Remark&#x9636;&#x6BB5;&#x505A;&#x4E00;&#x4E9B;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F53;&#x6EE1;&#x8DB3;&#x9884;&#x8BBE;&#x7684;&#x8FED;&#x4EE3;&#x6B21;&#x6570;&#x6216;&#x8005;&#x6EE1;&#x8DB3;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x9000;&#x51FA;&#xFF0C;&#x5728;&#x9000;&#x51FA;&#x4E4B;&#x524D;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x8BA9;Ramark&#x7EBF;&#x7A0B;&#x5E76;&#x884C;&#x7684;&#x53BB;&#x626B;&#x63CF;&#x5E74;&#x8F7B;&#x4EE3;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#x53D6;&#x51FA;&#x4E00;&#x4E2A;&#x5730;&#x5740;(&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F00;&#x59CB;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;Remark&#x5E76;&#x884C;&#x626B;&#x63CF;&#x65F6;&#x5E74;&#x8F7B;&#x4EE3;&#x65F6;&#x5F00;&#x59CB;&#x7684;&#x4F4D;&#x7F6E;(&#x5982;&#x679C;&#x968F;&#x4FBF;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E2D;&#x95F4;&#x4F4D;&#x7F6E;&#xFF0C;JVM&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x7ED3;&#x675F;&#x4E3A;&#x6B62;&#xFF0C;&#x9664;&#x975E;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5F00;&#x59CB;&#x4E3A;&#x6B62;&#x4E00;&#x904D;&#x4E00;&#x904D;&#x7684;&#x626B;&#x63CF;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x8D39;&#x65F6;&#xFF0C;&#x56E0;&#x6B64;&#x91C7;&#x7528;&#x4E86;&#x91C7;&#x6837;&#x7684;&#x529E;&#x6CD5;&#x6765;&#x786E;&#x5B9A;Remark&#x5E76;&#x884C;&#x626B;&#x63CF;&#x65F6;&#x5F00;&#x59CB;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x4F7F;&#x6BCF;&#x4E2A;Remark&#x626B;&#x63CF;&#x7EBF;&#x7A0B;&#x62E5;&#x6709;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x626B;&#x63CF;&#x91CF;&#xFF1F;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x5728;Remark&#x4E4B;&#x524D;&#x5E74;&#x8F7B;&#x4EE3;&#x80FD;&#x591F;&#x53D1;&#x751F;&#x4E00;&#x6B21;GC&#xFF0C;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;preclean&#x5728;&#x91C7;&#x6837;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x505A;&#x5230;&#x5927;&#x81F4;&#x5747;&#x5300;&#x7684;&#x6548;&#x679C;&#x3002;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x53C2;&#x6570;```CMSMaxAbortablePrecleanTime```&#x6765;&#x7B49;&#x5F85;&#x8FD9;&#x6837;&#x7684;&#x53D1;&#x751F;&#x3002;
<img src="/GC/GC.png" alt="GC.png" title="">

&gt; &#x5728;Remark&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x4E00;&#x6B21;minor GC&#xFF0C; Remark&#x7684;&#x5E76;&#x884C;&#x626B;&#x63CF;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x88AB;&#x5207;&#x5206;&#x6210;&#x5F88;&#x5747;&#x5300;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x6574;&#x4F53;&#x4E0A;&#x63D0;&#x9AD8;&#x4E86;&#x6807;&#x8BB0;&#x7684;&#x901F;&#x5EA6;&#x3002;<br>

&#x5F53;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x88AB;&#x6807;&#x8BB0;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x5C06;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x79FB;&#x9664;&#xFF0C;&#x56DE;&#x6536;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x56DE;&#x6536;&#x53EF;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x4EE5;&#x94FE;&#x8868;&#x5F62;&#x5F0F;&#x7EF4;&#x62A4;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;**&#x5728;CMS&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x4F1A;&#x538B;&#x7F29;&#x8001;&#x5E74;&#x4EE3;&#x3002;**  &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5F88;&#x591A;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x5F53;&#x8001;&#x5E74;&#x4EE3;&#x6CA1;&#x5408;&#x9002;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x6765;&#x5BB9;&#x7EB3;&#x5E74;&#x8F7B;&#x4EE3;&#x63D0;&#x5347;&#x7684;&#x5BF9;&#x8C61;&#x65F6;, &#x4E00;&#x4E2A;```promotion failed```&#x7684;&#x73B0;&#x8C61;&#x5C06;&#x4F1A;&#x4ECE;GC&#x65E5;&#x5FD7;&#x4E2D;&#x770B;&#x51FA;&#x6765;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;
<pre>
2016-08-19T15:48:11.956+0800: 560178.485: [GC (Allocation Failure) 2016-08-19T15:48:11.956+0800: 560178.485: [ParNew (promotion failed): <br>1839059K-&gt;1887488K(1887488K), 0.6432587 secs]2016-08-19T15:48:12.599+0800: 560179.129: [CMS: 7287285K-&gt;1382254K(10485760K), 49.4752022 secs] <br>8980348K-&gt;1382254K(12373248K), [Metaspace: 51114K-&gt;51114K(1095680K)], 50.1263301 secs] [Times: user=5.94 sys=0.58, real=50.12 secs]
</pre>
&#x5F53;&#x5E74;&#x8F7B;&#x4EE3;&#x53D1;&#x751F;```promotion failed```&#x73B0;&#x8C61;&#x65F6;&#xFF0C;&#x89E6;&#x53D1;&#x4E00;&#x4E2A;[```Concurrent Mode Failure```](https://blogs.oracle.com/poonam/entry/troubleshooting_long_gc_pauses)&#x7684;mark&#xFF0D;sweep-compact&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;(&#x5B9E;&#x9645;&#x4E0A;&#x662F;[Serial Old](https://blogs.oracle.com/jonthecollector/entry/our_collectors),&#x4E00;&#x79CD;&#x5355;&#x7EBF;&#x7A0B;&#x4E32;&#x884C;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;)&#xFF0C;&#x8FD9;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x6682;&#x505C;(stop-the-world), &#x538B;&#x7F29;&#x8001;&#x5E74;&#x4EE3;&#x3002;&#x8FD9;&#x6761;&#x65E5;&#x5FD7;&#x8868;&#x660E;&#xFF0C;&#x5F53;&#x5E74;&#x8F7B;&#x4EE3;&#x5C1D;&#x8BD5;&#x53D1;&#x751F;GC&#x65F6;(&#x5728;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x672A;&#x53D1;&#x751F;)&#xFF0C;&#x9884;&#x4F30;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x91CF;&#x8981;&#x5927;&#x4E8E;&#x5E74;&#x8001;&#x4EE3;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;(&#x5E74;&#x8001;&#x4EE3;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x788E;&#x7247;), &#x6B64;&#x65F6;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;&#x53D1;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x957F;&#x8FBE;50.12s&#x7684;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5E76;&#x538B;&#x7F29;&#x8001;&#x5E74;&#x4EE3;&#x3002;&#x8FD9;&#x8868;&#x660E;&#xFF0C;promote&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6574;&#x4E2A;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;

&#x5F88;&#x5947;&#x7279;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x7684;gc&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x540C;&#x6837;&#x53D1;&#x73B0;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x6761;&#x65E5;&#x5FD7;&#xFF1A;
<pre>
2016-08-22T05:37:00.136+0800: 2045776.564: [Full GC (Allocation Failure) 2045776.564: [CMS: 9204801K-&gt;2109938K(11049408K), <br>3.2929131 secs] 10530771K-&gt;2109938K(12429568K), [Metaspace: 52418K-&gt;52418K(1097728K)], 3.2931250 secs] [Times: user=3.26 sys=0.02, real=3.29 secs]
</pre>

<p>&#x8FD9;&#x6761;&#x65E5;&#x5FD7;&#x8868;&#x660E;&#xFF0C;&#x5F53;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5BF9;&#x8C61;&#x662F;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;&#x7136;&#x800C;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x5E76;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x5185;&#x5B58;&#x6765;&#x653E;&#x7F6E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5F15;&#x53D1;&#x7684;&#x4E00;&#x6B21;Full GC(stop-the-world).<br></p>
<p>&#x884C;&#x4E3A;&#x81F3;&#x6B64;&#xFF0C;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x542C;&#x522B;&#x4EBA;&#x8BF4;&#x5230;&#xFF0C;&#x8981;&#x9632;&#x6B62;Full GC&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x5E76;&#x4E0D;&#x6307;&#x7684;&#x662F;&#x8001;&#x5E74;&#x4EE3;&#x53D1;&#x751F;&#x7684;GC&#xFF0C;&#x800C;&#x662F;&#x5B58;&#x5728;&#x538B;&#x7F29;&#x5185;&#x5B58;&#x4EFB;&#x52A1;(&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53C2;&#x6570;&#x914D;&#x7F6E;&#xFF0C;&#x5F53;&#x53D1;&#x751F;&#x591A;&#x5C11;&#x6B21;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x8FDB;&#x884C;&#x538B;&#x7F29;)&#x7684;GC&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre>
  1, minor GC,  &#x6307;&#x7684;&#x662F;&#x53D1;&#x751F;&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x4E0A;&#x7684;mark&#xFF0D;copy&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x6682;&#x505C;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#xFF1B;
  2&#xFF0C;major GC&#xFF0C;  &#x6307;&#x7684;&#x662F;&#x53D1;&#x751F;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E0A;&#x7684;GC&#xFF0C;CMS&#x7B97;&#x6CD5;&#x5927;&#x90E8;&#x5206;&#x7684;&#x8FC7;&#x7A0B;&#x90FD;&#x4E0D;&#x7528;&#x6682;&#x505C;&#x5E94;&#x7528;&#xFF1B;
  3&#xFF0C;Full GC&#xFF0C;   &#x5B58;&#x5728;&#x538B;&#x7F29;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5408;&#x5E76;&#x788E;&#x7247;&#x4EFB;&#x52A1;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x5F53;&#x53D1;&#x751F;&#x65F6;&#xFF0C;concurrent-mark-sweep&#x53D8;&#x6210;mark-sweep-compact&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x3002;
</pre>

<p>&#x7136;&#x800C;&#xFF0C;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x8BEF;&#x533A;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;jstat&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;GC&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x53D1;&#x73B0;FGC&#x4E00;&#x680F;&#x7684;&#x6307;&#x6807;&#x4E2D;&#xFF0C;&#x5B58;&#x5728;FGC &gt; 0&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x7136;&#x800C;&#x5728;GC&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x5374;&#x53C8;&#x770B;&#x4E0D;&#x5230;mark-sweep-compact&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5B58;&#x5728;&#x3002;<strong>&#x8FD9;&#x4E2A;&#x6307;&#x6807;&#x7684;&#x542B;&#x4E49;&#x662F;major GC&#x4EE5;&#x53CA;Full GC&#x6682;&#x505C;&#x5E94;&#x7528;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4E00;&#x6B21;CMS&#x7684;major GC&#x6682;&#x505C;&#x5E94;&#x7528;&#x4E24;&#x6B21;&#xFF0C;&#x4E00;&#x6B21;Full GC&#x6682;&#x505C;&#x4E00;&#x6B21;&#xFF0C; &#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x548C;&#x65E5;&#x5FD7;&#x4E0A;&#x7684;&#x8BB0;&#x5F55;&#x5339;&#x914D;&#xFF0C;&#x603B;&#x8017;&#x8D39;&#x65F6;&#x95F4;&#x4E5F;&#x5339;&#x914D;&#x5F97;&#x4E0A;&#x3002;</strong></p>
<p>&#x5E74;&#x8F7B;&#x4EE3;&#x7684;GC&#xFF0C;&#x662F;&#x7531;&#x4E8E;&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;Eden&#x533A;&#x57DF;&#x5185;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x5185;&#x5B58;&#x6765;&#x5206;&#x914D;&#x8BE5;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F4D;&#x4E8E;eden&#x4EE5;&#x53CA;survivor&#x533A;&#x57DF;&#x5185;&#x7684;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x4F1A;&#x88AB;&#x62F7;&#x8D1D;&#x5230;&#x53E6;&#x4E00;&#x4E2A;survivor&#x533A;&#xFF0C;&#x540C;&#x65F6;&#x8FD9;&#x4E24;&#x4E2A;&#x533A;&#x57DF;&#x4F1A;&#x88AB;&#x6E05;&#x7A7A;&#xFF0C;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#xFF0C;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;survivor&#x662F;active&#x7684;(&#x53CC;buffer)&#xFF08;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#x60C5;&#x51B5;&#x6765;&#x8BC1;&#x660E;&#xFF09;&#xFF0C; &#x5F53;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x53CD;&#x590D;&#x7ECF;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#x540E;(age &gt; MaxTenuringThreshold)&#xFF0C;&#x5BF9;&#x8C61;&#x4FBF;&#x4F1A;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;&#x7136;&#x800C;&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x53D1;&#x751F;GC&#x4E4B;&#x524D;&#xFF0C;&#x5979;&#x4F1A;&#x9996;&#x5148;&#x4F30;&#x7B97;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;(&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x6BD4;&#x5B9E;&#x9645;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x8981;&#x7B2C;&#xFF09;&#xFF0C;&#x786E;&#x4FDD;&#x8001;&#x5E74;&#x4EE3;&#x6709;&#x8DB3;&#x591F;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x6765;&#x5BB9;&#x7EB3;&#x4F30;&#x7B97;&#x7684;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x5E74;&#x8001;&#x4EE3;&#x7684;GC&#x5219;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x539F;&#x7406;&#x7C7B;&#x4F3C;&#xFF0C;&#x90FD;&#x662F;&#x5F53;&#x89E6;&#x53D1;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;GC&#x53D1;&#x751F;&#x7684;&#x76F8;&#x5173;&#x6761;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;GC&#x8C03;&#x4F18;&#x3002;<br>&#x5728;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#xFF0C;&#x5982;&#x4F55;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#xFF0C;&#x7EC6;&#x8282;&#x53EF;&#x53C2;&#x8003;<a href="https://blogs.oracle.com/daviddetlefs/entry/tlab_sizing_an_annoying_little" target="_blank" rel="external">Thread Local Allocation Buffer</a>.</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5F15;&#x5165;&#x4E00;&#x5F20;&#x8001;&#x56FE;&#x7247;&#x8BF4;&#x660E;CMS GC&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;GC&#xFF1A;<br><img src="/GC/CMS_GC.png" alt="CMS_GC.png" title=""></p>
<p>&#x5BF9;&#x4E8E;&#x5982;&#x4F55;&#x9632;&#x6CBB;CMS&#x5185;&#x5B58;&#x788E;&#x7247;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x51CF;&#x5C11;promotion&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5E38;&#x89C4;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x8BA9;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x63D0;&#x524D;&#x5230;&#x6765;&#x3002;<a href="https://blogs.oracle.com/jonthecollector/entry/when_the_sum_of_the" target="_blank" rel="external">&#x67E5;&#x770B;&#x5982;&#x4F55;&#x6CBB;&#x7406;&#x5185;&#x5B58;&#x788E;&#x7247;</a></p>
<blockquote>
<p>&#x4E24;&#x4E2A;&#x6307;&#x6807;<br></p>
</blockquote>
<p>  <em>Latency</em>:&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x4E2A;&#x4F53;&#x6027;&#x7684;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x3002;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x63CF;&#x8FF0;&#x6709;&#xFF1A;<br><br>  <pre><br>    1, 99%&#x7684;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x5728;1s&#x4E4B;&#x5185;&#x8FD4;&#x56DE;&#xFF1B;<br>    2&#xFF0C;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x6027;&#x64CD;&#x4F5C;&#x4E0D;&#x8D85;&#x8FC7;10s&#xFF1B;<br>  </pre></p>
<p>  &#x5982;&#x4F55;&#x8BC4;&#x4F30;&#xFF1F;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x8BA1;&#x7B97;&#x4EE5;&#x53CA;&#x5B58;&#x50A8;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x8017;&#x8D39;&#x4E00;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x65E5;&#x5FD7;&#x5DE5;&#x5177;&#x5206;&#x6790;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5047;&#x8BBE;&#x7531;&#x4E8E;GC&#x5BFC;&#x81F4;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x4E0D;&#x8D85;&#x8FC7;&#x4E2D;&#x8BF7;&#x6C42;&#x65F6;&#x95F4;&#x7684;10%, &#x5219;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;99%&#x7684;GC&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;100ms&#xFF0C;&#x6240;&#x6709;&#x7684;GC&#x6700;&#x957F;&#x65F6;&#x95F4;&#x4E0D;&#x53EF;&#x4EE5;&#x8D85;&#x8FC7;1s&#x3002;</p>
<p>  <em>Throughput</em>:&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x5355;&#x4F4D;&#x5185;&#xFF0C;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x603B;&#x91CF;&#xFF0C;&#x5173;&#x6CE8;&#x4E8E;&#x603B;&#x4F53;&#x6548;&#x679C;&#x3002;&#x7C7B;&#x4F3C;&#x7684;&#x63CF;&#x8FF0;&#x6709;&#xFF1A;<br></p>
<pre>
   1, &#x7CFB;&#x7EDF;&#x9700;&#x8981;1min&#x5904;&#x7406;1000&#x6761;&#x4E8B;&#x52A1;&#xFF1B;
   2&#xFF0C;&#x6240;&#x6709;&#x987E;&#x5BA2;&#x7684;&#x4E00;&#x5468;&#x5185;&#x7684;&#x5206;&#x6790;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x5728;&#x5468;&#x4E00;6&#x70B9;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#xFF0C;&#x4ECE;&#x51CC;&#x6668;0&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x4E0D;&#x8D85;&#x8FC7;6&#x4E2A;&#x5C0F;&#x65F6;&#x3002;
</pre>

<p>&#x4F9D;&#x7136;&#x5206;&#x6790;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5047;&#x8BBE;&#x6700;&#x591A;10%&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x7528;&#x4E8E;GC&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4EFB;&#x610F;1min&#x4E2D;&#x5185;&#xFF0C;GC&#x7684;&#x603B;&#x65F6;&#x95F4;&#x4E0D;&#x8D85;&#x8FC7;6s&#x3002;</p>
<p></p><h2>&#x8C03;&#x4F18;&#x76EE;&#x6807;</h2><p></p>
<li>&#x5355;&#x6B21;GC&#x7684;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;1s&#x3002;</li><br><li>99%&#x7684;minor GC&#x9700;&#x8981;&#x5728;30ms &#xFF5E; 40ms&#x3002;</li><br><li>&#x5F53;&#x7CFB;&#x7EDF;&#x7E41;&#x5FD9;&#x65F6;&#xFF0C;1min&#x4E4B;&#x5185;&#xFF0C;minor GC&#x603B;&#x65F6;&#x95F4;&#x4E0D;&#x5F97;&#x8D85;&#x8FC7;1s</li>


<p><strong>GC&#x6700;&#x96BE;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x4E4B;&#x95F4;&#x53D6;&#x5F97;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x3002;</strong>&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x7684;&#x7ECF;&#x9A8C;&#x503C;&#x503C;&#x5F97;&#x501F;&#x9274;&#xFF0C;&#x6709;<a href="https://docs.oracle.com/cd/E19900-01/819-4742/abeik/index.html" target="_blank" rel="external">1/3</a>, &#x4E5F;&#x6709;&#x8BBE;&#x7F6E;<a href="https://engineering.linkedin.com/garbage-collection/garbage-collection-optimization-high-throughput-and-low-latency-java-applications" target="_blank" rel="external">1/6</a>,&#x66FE;&#x7ECF;&#x4E5F;&#x770B;&#x5230;&#x8FC7;&#x5E74;&#x8F7B;&#x4EE3;&#x53EA;&#x6709;200m&#xFF0C;&#x800C;&#x5E74;&#x8001;&#x4EE3;&#x5360;&#x7528;10+g&#x7684;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x611F;&#x89C9;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x4F3C;&#x4E4E;&#x662F;&#x6BEB;&#x65E0;&#x7AE0;&#x6CD5;&#x53EF;&#x8A00;&#xFF0C;&#x4E5F;&#x8BB8;&#x5C31;&#x50CF;<a href="https://docs.oracle.com/cd/E19900-01/819-4742/abeik/index.html" target="_blank" rel="external">&#x8FD9;&#x91CC;</a>&#x63CF;&#x8FF0;&#xFF0C;&#x6839;&#x636E;&#x6027;&#x80FD;&#x6307;&#x6807;&#xFF0C;&#x753B;&#x51FA;&#x4E00;&#x4E2A;&#x56FE;&#xFF0C;&#x5728;&#x56FE;&#x4E2D;&#x627E;&#x51FA;&#x4E00;&#x4E2A;&#x6700;&#x4F73;&#x7684;&#x5339;&#x914D;&#x70B9;?</p>
<p>&#x5728;&#x8D44;&#x6E90;&#x65E0;&#x9650;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x5EF6;&#x8FDF;&#x548C;&#x541E;&#x5410;&#x91CF;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;GC&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#xFF0C;&#x60C5;&#x51B5;&#x5374;&#x5E76;&#x975E;&#x8FD9;&#x6837;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x60F3;&#x5C3D;&#x91CF;&#x8BA9;GC&#x5BF9;&#x5E94;&#x7528;&#x9020;&#x6210;&#x7684;&#x5F71;&#x54CD;&#x8FBE;&#x5230;&#x6700;&#x5C0F;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E9B;&#x8C03;&#x4F18;&#x7684;&#x7ECF;&#x9A8C;&#x5177;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6307;&#x5BFC;&#x610F;&#x4E49;&#x3002;&#x7136;&#x800C;&#x5343;&#x4EBA;&#x5343;&#x9762;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>GC&#x65E5;&#x5FD7;&#x662F;&#x8C03;&#x4F18;&#x8FC7;&#x7A0B;&#x6700;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x6750;&#x6599;&#xFF0C;&#x521D;&#x671F;&#x8981;&#x5C3D;&#x91CF;&#x4E30;&#x5BCC;&#x65E5;&#x5FD7;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x91CC;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x547D;&#x4EE4;&#x6709;&#xFF1A;</p>
<pre>
-XX:+PrintTenuringDistribution
-XX:+PrintPromotionFailure
-XX:+PrintGCDateStamps
-XX:+PrintGCDetails
-XX:+PrintHeapAtGC
-Xloggc:$file
-XX:+PrintGCApplicationStoppedTime
</pre>

<p>&#x5BF9;&#x4E8E;&#x5E74;&#x8F7B;&#x4EE3;&#x6765;&#x8BF4;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8BA9;&#x5BF9;&#x8C61;&#x5728;&#x4E24;&#x4E2A;survivor&#x533A;&#x57DF;&#x5185;&#x62F7;&#x6765;&#x62F7;&#x53BB;&#xFF0C;&#x964D;&#x4F4E;minorGC&#x7684;&#x9891;&#x5EA6;&#xFF0C;&#x964D;&#x4F4E;&#x5411;&#x8001;&#x5E74;&#x4EE3;&#x63D0;&#x5347;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x9891;&#x5EA6;&#x3002;&#x5BF9;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x6765;&#x8BF4;&#xFF0C;&#x5219;&#x8981;&#x6C42;&#x8001;&#x5E74;&#x4EE3;GC&#x9891;&#x5EA6;&#x8D8A;&#x597D;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x80FD;&#x591F;&#x63D0;&#x524D;GC&#xFF0C;&#x51CF;&#x5C11;&#x53D1;&#x751F;promotion fail&#x7684;&#x73B0;&#x8C61;&#x3002;&#x9274;&#x4E8E;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x636E;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#xFF0C;&#x9009;&#x62E9;&#x4E86;CMS&#x6765;&#x56DE;&#x6536;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x4F7F;&#x7528;&#x4E0E;&#x4E4B;&#x914D;&#x5957;&#x7684;UseParNewGC&#x6765;&#x56DE;&#x6536;&#x5E74;&#x8F7B;&#x4EE3;&#x3002;</p>
<pre>
-XX:+UseParNewGC
-XX:+UseConcMarkSweepGC
</pre>

<p>&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x5E76;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x53EA;&#x8BBE;&#x7F6E;&#x4E86;&#x6700;&#x5927;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;(-Xmx)&#x3002; &#x8FD9;&#x6837;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x5728;&#x6709;&#x4E9B;&#x673A;&#x5668;&#x4E0A;&#x4E5F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x541E;&#x5410;&#x91CF;&#x8FBE;&#x5230;99.83%&#xFF0C;&#x7136;&#x800C;&#x5176;&#x6700;&#x5927;GC&#x65F6;&#x95F4;&#x8FBE;&#x5230;32s&#xFF0C;&#x6709;&#x4E9B;&#x673A;&#x5668;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;60s&#x800C;&#x88AB;&#x8BEF;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x5954;&#x6E83;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x9000;&#x51FA;&#x3002;</p>
<blockquote>
<p>GC&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x6307;&#x6807;&#x3002;<br><img src="/GC/gc_states.png" alt="gc_states.png" title=""><br>GC &#x65F6;&#x95F4;&#x8D85;&#x8FC7;60s&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x9000;&#x51FA;&#x3002;</p>
<pre>
2016-08-13 04:11:37,655 WARN  [JvmPauseMonitor] util.JvmPauseMonitor: Detected pause in JVM or host machine (eg GC): pause of approximately 99244ms
GC pool &apos;ParNew&apos; had collection(s): count=1 time=1091ms
GC pool &apos;ConcurrentMarkSweep&apos; had collection(s): count=1 time=98532ms
</pre>

</blockquote>
<p>&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x671F;&#x671B;&#x7684;&#x3002;&#x4F5C;&#x4E3A;&#x540E;&#x53F0;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x671F;&#x671B;&#x7684;&#x662F;&#x670D;&#x52A1;&#x7A33;&#x5B9A;&#xFF0C;&#x5728;&#x7A33;&#x5B9A;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#xFF0C;&#x5173;&#x6CE8;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x3002;<br><br><strong>1, &#x8BBE;&#x7F6E;&#x5E74;&#x8F7B;&#x4EE3;&#x5927;&#x5C0F;&#x4E3A;2g&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;maxAge&#xFF1D;10(&#x9ED8;&#x8BA4;&#x4E3A;8)&#xFF0C; &#x5E76;&#x589E;&#x52A0;gc&#x65E5;&#x5FD7;&#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x5206;&#x5E03;&#x8F93;&#x51FA;&#x3002;</strong></p>
<pre>
  -Xmn2g
  -XX:MaxTenuringThreshold=10
  -XX:+PrintTenuringDistribution
</pre>

<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x9AD8;&#x5CF0;&#x671F;&#x65F6;&#xFF0C;GC&#x6682;&#x505C;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;50s&#xFF0C;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x9000;&#x51FA;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x6BD4;&#x539F;&#x6765;&#x66F4;&#x7CDF;&#x7CD5;&#xFF1A;</p>
<pre>
2016-08-19T15:47:53.882+0800: 560160.411: [GC (Allocation Failure) 2016-08-19T15:47:53.882+0800: 560160.411: [ParNew
Desired survivor size 107347968 bytes, new threshold 1 (max 10)
- age   1:  160893280 bytes,  160893280 total
  : 1887488K-&gt;161235K(1887488K), 3.3464076 secs] 8970842K-&gt;7302524K(12373248K), 3.3466849 secs] [Times: user=57.36 sys=0.00, real=3.35 secs]
  2016-08-19T15:48:11.956+0800: 560178.485: [GC (Allocation Failure) 2016-08-19T15:48:11.956+0800: 560178.485: [ParNew (promotion failed): 1839059K-&gt;1887488K(1887488K), 0.6432587 secs]2016-08-19T15:48:12.599+0800: 560179.129: [CMS: 7287285K-&gt;1382254K(10485760K), 49.4752022 secs] 8980348K-&gt;1382254K(12373248K), [Metaspace: 51114K-&gt;51114K(1095680K)], 50.1263301 secs] [Times: user=5.94 sys=0.58, real=50.12 secs]
  </pre>

<p>&#x5206;&#x6790;&#x8FD9;&#x6BB5;GC&#x65E5;&#x5FD7;&#xFF0C;&#x4E0A;&#x4E00;&#x6B21;GC&#x53D1;&#x751F;&#x65F6;&#xFF0C;survivor&#x5185;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x5927;&#x81F4;&#x6709;161M&#x3002;eden&#x533A;&#x57DF;&#x5185;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x5728;107M&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x8981;&#x88AB;&#x62F7;&#x8D1D;&#x5230;survivor&#x4E2D;&#xFF0C;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x8D85;&#x8FC7;&#x4E00;&#x4E2A;survivor&#x5185;&#x5B58;&#x7684;50%(&#x4E00;&#x4E2A;survivor&#x7684;&#x5927;&#x5C0F;&#x5728;188.7M&#xFF09;&#xFF0C;&#x4E8E;&#x662F;&#x5C06;&#x5BF9;&#x8C61;&#x7684;tenure age&#x4ECE;10&#x53D8;&#x6210;1, age 1 &#x6EE1;&#x8DB3;total(age1&#xFF0B;&#x2026;+agex)&#xFF0F;young &gt; 50%. &#x56E0;&#x6B64;&#x5F53;&#x4E0B;&#x4E00;&#x6B21;&#x5E74;&#x8F7B;&#x4EE3;GC&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x6574;&#x4E2A;&#x5E74;&#x8F7B;&#x4EE3;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x5C06;&#x88AB;&#x76F4;&#x63A5;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x3002;&#x5728;&#x8FDB;&#x884C;young GC&#x65F6;&#xFF0C;jvm&#x9996;&#x5148;&#x8981;&#x4FDD;&#x8BC1;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x6709;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x7A7A;&#x95F4;&#x80FD;&#x591F;&#x5BB9;&#x7EB3;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x88AB;&#x4FDD;&#x8BC1;&#x3002;&#x4E00;&#x6B21;&#x957F;&#x8FBE;50s&#x7684;Full GC&#x88AB;&#x89E6;&#x53D1;&#x2026;</p>
<p>&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x65E5;&#x5FD7;&#xFF0C;&#x8868;&#x660E;&#x5728;&#x7CFB;&#x7EDF;&#x7E41;&#x5FD9;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5E74;&#x8F7B;&#x4EE3;&#x5E76;&#x4E0D;&#x4F1A;&#x8D77;&#x5230;&#x5E94;&#x6709;&#x7684;&#x4F5C;&#x7528;&#xFF1B;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x65E5;&#x5FD7;&#xFF0C;&#x53D1;&#x73B0;&#x5927;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x5728;4 &#xFF5E; 6&#x4EE3;&#x65F6;&#xFF0C;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7A33;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5C06;tenure age&#x8BBE;&#x7F6E;&#x4E3A;10&#xFF0C;&#x6765;&#x56DE;&#x589E;&#x52A0;&#x4E86;4&#x6B21;&#x62F7;&#x8D1D;&#xFF0C;&#x5F71;&#x54CD;&#x5230;&#x5E74;&#x8F7B;&#x4EE3;GC&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x6559;&#x8BAD;&#xFF0C;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x662F;&#x964D;&#x4F4E;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5C31;&#x6709;&#x7684;&#x65E5;&#x5FD7;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x672A;&#x8BBE;&#x7F6E;&#x5E74;&#x8F7B;&#x4EE3;&#x5927;&#x5C0F;&#x4E14;&#x670D;&#x52A1;&#x5DF2;&#x7ECF;&#x8FDE;&#x7EED;30&#x5929;&#x4E0D;&#x4E2D;&#x65AD;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;&#x6500;&#x5230;&#x7684;&#x6700;&#x5927;&#x503C;&#x4E3A;1.32g&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x5219;&#x4FE1;&#x606F;&#xFF0C;&#x5C06;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#x53D8;&#x6210;1200m&#xFF0C;&#x5C06;tenure age&#x8BBE;&#x7F6E;&#x4E3A;6&#xFF0C;&#x540C;&#x65F6;CMSInitiatingOccupancyFraction&#x4ECE;75&#x8BBE;&#x7F6E;&#x6210;70&#xFF0C;&#x91CD;&#x65B0;&#x89C2;&#x6D4B;&#x670D;&#x52A1;GC&#x65E5;&#x5FD7;&#x3002;</p>
<pre>
   -Xmn1200m
   -XX:MaxTenuringThreshold=6
   -XX:CMSInitiatingOccupancyFraction=70
</pre>

<p>&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x6307;&#x6807;&#x6570;&#x636E;&#xFF1A;<br><br>A:<br><br><img src="/GC/gc_a_states.png" alt="gc_a_states.png" title=""><br><img src="/GC/gc_a_summary.png" alt="gc_a_summary.png" title=""></p>
<p>&#x53D1;&#x73B0;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;GC&#x8FC7;&#x4E8E;&#x9891;&#x7E41;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x5C06;-XX:TargetSurvivorRatio&#x8C03;&#x5347;&#x5230;80&#x65F6;&#xFF0C;&#x867D;&#x7136;&#x8001;&#x5E74;&#x4EE3;GC&#x6574;&#x4F53;&#x4E0A;&#x6709;&#x4E86;&#x4E0B;&#x964D;&#x7684;&#x8D8B;&#x52BF;&#xFF0C;&#x7136;&#x800C;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x4F18;&#x4E0D;&#x7BA1;&#x5E74;&#x8F7B;&#x4EE3;&#xFF0C;&#x8FD8;&#x662F;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x5E73;&#x5747;&#x7684;gc&#x6682;&#x505C;&#x65F6;&#x95F4;&#x90FD;&#x6709;&#x6240;&#x4E0A;&#x5347;&#xFF1A;<br><img src="/GC/gc_b_states.png" alt="gc_b_states.png" title=""><br><img src="/GC/gc_b_summary.png" alt="gc_b_summary.png" title=""><br>&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x4F18;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4F18;&#x5316;&#x591A;&#x5C11;&#xFF0C;&#x8BE5;&#x65B9;&#x6848;&#x88AB;&#x653E;&#x5F03;&#x3002;&#x7136;&#x800C;&#x5176;&#x80FD;&#x964D;&#x4F4E;&#x8001;&#x5E74;&#x4EE3;GC&#x7684;&#x9891;&#x7387;&#x8FD8;&#x662F;&#x7ED9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x3002; </p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x4E5F;&#x8FD8;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x5C3D;&#x91CF;&#x5C06;&#x6700;&#x5927;&#x5EF6;&#x8FDF;&#x964D;&#x4F4E;&#x5230;1s&#x3002;&#x7136;&#x800C;&#x5728;GC&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x8FD8;&#x662F;&#x770B;&#x5230;&#x4E86;&#x7531;&#x4E8E;promotion failed&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x5C06;&#x5E94;&#x7528;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x62C9;&#x9AD8;&#x5230;2&#xFF5E;3s&#xFF0C;10&#x5929;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x53D1;&#x751F;&#x4E86;&#x4E09;&#x6B21;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x670D;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6548;&#x679C;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x4E0D;&#x592A;&#x6EE1;&#x610F;&#x7684;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5206;&#x6790;&#x65E5;&#x5FD7;&#xFF0C;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#x5728;&#x7E41;&#x5FD9;&#x65F6;&#xFF0C;1s&#x4E4B;&#x5185;&#x5927;&#x6982;&#x4EA7;&#x751F;1&#xFF5E;2g&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5927;&#x6982;9/10&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x4E0B;&#x4E00;&#x6B21;GC&#x65F6;&#xFF0C;&#x662F;&#x88AB;&#x5F53;&#x4F5C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#xFF0C;&#x7EA6;1/10&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x62F7;&#x8D1D;&#x5230;survivor&#x533A;&#x57DF;&#xFF0C; &#x7B2C;&#x4E8C;&#x6B21;GC&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x7EA6;&#x6709;95%&#x7684;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#xFF0C;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E24;&#x6B21;GC&#x65F6;&#xFF0C;1g&#x7684;&#x5BF9;&#x8C61;&#x53D8;&#x6210;&#xFF1A; 1000 <em> 0.1 </em> 0.95 = 95M&#x5DE6;&#x53F3;&#xFF0C;&#x5F53;&#x5E74;&#x8F7B;&#x4EE3;&#x518D;&#x53D1;&#x751F;&#x4E00;&#x6B21;GC&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;age&#x5C06;&#x53D8;&#x6210;3&#xFF0C;&#x7EA6;70&#xFF05;&#x7684;&#x5BF9;&#x8C61;&#x5B58;&#x6D3B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x88AB;&#x62F7;&#x8D1D;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x4F30;&#x7B97;&#x4E00;&#x4E0B;&#xFF1A;<br>  <pre><br>                eden    survivor<br>     1st:        0      1g-&gt;100M<br>     2nd:        0      1g-&gt;100M + 95M(1st)<br>     3rd:        0      1g-&gt;100M + 95M(2nd)  70M(1st -&gt; tenured age)<br>  </pre></p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5728;survivor&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x81F3;&#x5C11;&#x8981;&#x5927;&#x4E8E;300M&#xFF0C;&#x624D;&#x53EF;&#x80FD;&#x9002;&#x5E94;&#x9AD8;&#x5CF0;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E9B;&#x5206;&#x914D;&#xFF1A;</p>
<pre>
eden 1000M
survivor 2 * 300M
</pre>
&#x5E74;&#x8F7B;&#x4EE3;&#x603B;&#x5171;&#x7684;&#x5927;&#x5C0F;&#x4E3A;1600M&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x4EE5;&#x4E0B;&#x7684;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#xFF1A;
<pre>
-Xmn1500m
-XX:MaxTenuringThreshold=5
-XX:TargetSurvivorRatio=66
</pre>

<p>&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x8001;&#x5E74;&#x4EE3;&#x6BD4;&#x539F;&#x6765;&#x7684;&#x8BBE;&#x7F6E;&#x6765;&#x8BF4;&#xFF0C;&#x589E;&#x957F;&#x53D8;&#x5F97;&#x7F13;&#x6162;&#x8D77;&#x6765;&#x3002;&#x7136;&#x800C;&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;&#x7684;GC&#x5374;&#x53D8;&#x957F;&#xFF0C;&#x4ECE;&#x539F;&#x6765;&#x7684;&#x5E73;&#x5747;30 ~ 50ms&#x53D8;&#x6210;80 &#xFF5E; 150ms(&#x67D0;&#x4E00;&#x65F6;&#x6BB5;&#x7684;&#x5E73;&#x5747;&#x503C;)&#xFF0C;&#x6709;&#x4E9B;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;GC&#x751A;&#x81F3;&#x8D85;&#x8FC7;1s&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;GC&#x8FD8;&#x662F;&#x6709;&#x7740;&#x8C03;&#x4F18;&#x7684;&#x7A7A;&#x95F4;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x6BB5;&#x6BD4;&#x8F83;&#x7279;&#x522B;&#x7684;GC&#x65E5;&#x5FD7;&#xFF1A;<br>&#x4ECE;&#x65E5;&#x5FD7;&#x4E2D;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x5F53;&#x4E0A;&#x5347;&#x5230;3w&#xFF0F;qps&#x65F6;&#xFF0C; &#x5E74;&#x8F7B;&#x4EE3;&#x7684;GC&#x53D8;&#x5F97;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x9AD8;&#x8FBE;7s&#x3002;<br>&#x5C06;&#x5E74;&#x8F7B;&#x4EE3;&#x5927;&#x5C0F;&#x4ECE;1200M&#x63D0;&#x5347;&#x5230;1500M&#xFF0C;&#x4ECE;GC&#x7684;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C; &#x53D1;&#x751F;<em>promotion failed</em>&#x7684;&#x6B21;&#x6570;&#x964D;&#x4F4E;&#x4E86;&#x8BB8;&#x591A;&#xFF0C;&#x540C;&#x65F6;&#x7EDF;&#x8BA1;&#x5728;GC&#x65F6;&#x95F4;&#x6570;&#x8D85;&#x8FC7;1s&#x7684;&#x6B21;&#x6570;&#x4ECE;112&#x6B21;(dn2)&#x964D;&#x4F4E;&#x5230;70&#x6B21;(dn18), &#x5728;&#x4E24;&#x53F0;RegionServer&#x670D;&#x52A1;&#x5CF0;&#x7C7B;&#x4F3C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
<p><strong>&#x600E;&#x6837;&#x8C03;&#x6574;&#x5E74;&#x8F7B;&#x4EE3;</strong></p>
<p>&#x5F53;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x4E2D;&#xFF0C;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x53D8;&#x6210;&#x8F83;&#x5927;&#x6BD4;&#x4F8B;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x5728;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x9AD8;&#x5CF0;(&#x5F02;&#x5E38;&#x8BF7;&#x6C42;&#x9AD8;&#x5CF0;)&#xFF0C;&#x521B;&#x5EFA;&#x5927;&#x91CF;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6B64;&#x65F6;&#x4FBF;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;<code>promotion failed</code>&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F02;&#x5E38;&#x5C06;&#x5BFC;&#x81F4;&#x670D;&#x52A1;&#x88AB;&#x4E2D;&#x65AD; 2 &#xFF5E; 5s&#x3002;</p>
<p>&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF1F;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7A33;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;gc&#x65E5;&#x5FD7;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x79EF;&#x7D2F;&#x800C;&#x6162;&#x6162;&#x53D8;&#x5927;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x5F00;&#x542F;gc&#x65E5;&#x5FD7;&#x81EA;&#x52A8;roll&#x7684;&#x529F;&#x80FD;(&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x672A;&#x5F00;&#x542F;&#x7684;),</p>
<p><pre><br>-XX:+UseGCLogFileRotation<br>-XX:NumberOfGCLogFiles=5<br>-XX:GCLogFileSize=80M<br></pre><br>&#x5F53;&#x6587;&#x4EF6;&#x8FC7;&#x5927;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x4E0D;&#x8BA9;&#x670D;&#x52A1;&#x91CD;&#x542F;&#x6682;&#x505C;&#xFF0C;&#x4E0D;&#x5F97;&#x5DF2;&#x91C7;&#x53D6;<strong>jinfo -J-d64 -flag -PrintGCDetails 93411</strong>&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x51CF;&#x5C11;GC&#x65E5;&#x5FD7;&#x7684;&#x8F93;&#x51FA;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x7B97;&#x5176;&#x4E2D;&#x7684;&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x5728;openJDK1.8&#x4E2D;&#xFF0C;&#x5F53;&#x672A;&#x8BBE;&#x7F6E;GC&#x7B56;&#x7565;&#x65F6;&#x5019;&#xFF0C;&#x5F53;&#x8BBE;&#x7F6E;&#x7684;&#x5185;&#x5B58;(-Xmx)&#x6BD4;&#x8F83;&#x5C0F;&#x65F6;(&#x5728;&#xFF0D;Xmx1500m&#x89C2;&#x6D4B;&#x5230;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#xFF0C;64&#x4F4D;JVM)&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x662F;&#x4E00;&#x79CD;&#xFF1A;<em>UseParallelGC</em> + <em>UseParallelOldGC( a multithreaded STW compacting collector for old generation(do copy memories as well))</em>&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;(&#x5373;&#x4F7F;&#x8BBE;&#x7F6E;&#xFF0D;Xmn&#xFF0C;&#x7ED3;&#x679C;&#x4E5F;&#x4E00;&#x6837;)&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;(-Xmx&gt;15g),&#x53D1;&#x73B0;&#x5176;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x53D8;&#x6210;CMS&#xFF0B;ParNewGC&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x5148;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#xFF0C;&#x8FD9;&#x6837;&#x65B9;&#x4FBF;&#x4E8E;&#x540E;&#x671F;&#x7EF4;&#x62A4;&#x548C;&#x8C03;&#x4F18;&#x3002;&#x5728;&#x540E;&#x6765;&#x7684;&#x7EF4;&#x62A4;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x52A0;&#x5165;&#x201D;-XX:-UseBiasedLocking -XX:+PerfDisableSharedMem&#x201D; &#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x5728;&#x9AD8;&#x5E76;&#x53D1;&#x7684;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;GC&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002; &#x53E6;&#x5916;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;swappiness&#x53C2;&#x6570;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x8C03;&#x4F18;&#x9879;&#xFF0C;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;GC&#x548C;&#x6027;&#x80FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x5230;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5C0F;&#x4E8E;&#x4EE5;&#x524D;&#x7684;&#x8BBF;&#x95EE;&#x538B;&#x529B;&#x4E0B;&#xFF0C;&#x8FDE;&#x7EED;&#x5927;&#x4E8E;&#x534A;&#x5E74;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#xFF0C;&#x8FBE;&#x5230;&#x6700;&#x521D;&#x7684;&#x76EE;&#x7684;(&#x5728;&#x7A33;&#x5B9A;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x63D0;&#x5347;&#x6027;&#x80FD;)&#xFF0C; &#x540E;&#x7EED;&#x5C06;&#x6301;&#x7EED;&#x5173;&#x6CE8;GC&#x8C03;&#x4F18;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E9B;&#x8C03;&#x4F18;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x89C1;&#x4E4B;&#x524D;&#x53D1;&#x8FC7;&#x7684;&#x4E00;&#x7BC7;HBase ppt&#x3002;</p>
<blockquote>
<p>Reference</p>
</blockquote>
<li><a href="https://plumbr.eu/handbook/gc-tuning/throughput-vs-latency-vs-capacity" target="_blank" rel="external">https://plumbr.eu/handbook/gc-tuning/throughput-vs-latency-vs-capacity</a></li><br><li><a href="https://blogs.oracle.com/jonthecollector/entry/when\_the\_sum\_of\_the" target="_blank" rel="external">https://blogs.oracle.com/jonthecollector/entry/when\_the\_sum\_of\_the</a></li><br><li><a href="https://blogs.oracle.com/jonthecollector/entry/our_collectors" target="_blank" rel="external">https://blogs.oracle.com/jonthecollector/entry/our_collectors</a></li><br><li><a href="https://issues.apache.org/jira/browse/CASSANDRA-8150" target="_blank" rel="external">https://issues.apache.org/jira/browse/CASSANDRA-8150</a></li><br><li><a href="https://www.elastic.co/guide/en/elasticsearch/guide/current/heap-sizing.html" target="_blank" rel="external">https://www.elastic.co/guide/en/elasticsearch/guide/current/heap-sizing.html</a></li><br><li><a href="http://www.oracle.com/technetwork/tutorials/tutorials-1876574.html" target="_blank" rel="external">http://www.oracle.com/technetwork/tutorials/tutorials-1876574.html</a></li>





</div></article><div class="tags"><a href="../tags/JAVA/">JAVA</a><a href="../tags/GC/">GC</a><a href="../tags/HBase/">HBase</a></div><div class="paginator"><a href="../update_jar/" class="prev"><i class="iconfont icon-left"></i><span> 上一页</span></a><a href="../hive_issues/" class="next"><span>下一页</span><i class="iconfont icon-right"></i></a></div><section id="comments"><div id="disqus_thread"></div></section><script type="text/javascript">var disqus_config = function () {
    this.page.url = 'https://dengzhhu653.github.io/GC/';
    this.page.identifier = 'GC/';
    this.page.title = 'Java GC';
};
(function() {
var d = document, s = d.createElement('script');

s.src = '//dengzhhu653.disqus.com/embed.js';

s.setAttribute('data-timestamp', +new Date());
(d.head || d.body).appendChild(s);
})();</script></section><footer><div class="copyright"><p class="power">Powered by <a href="https://hexo.io/">Hexo</a> and Theme by <a href="https://github.com/ahonn/hexo-theme-even"> Even</a></p><p class="since">&copy;2018<span class="heart"><i class="iconfont icon-heart"></i></span><span class="author">Zhihua Deng</span></p></div><label id="back2top"><i class="iconfont icon-up"></i></label></footer></div><script src="/js/zepto.min.js"></script><script src="/js/theme.js"></script></body></html>